Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/demo/microchip/same54_xplained_pro/acme_client_demo/src/main.c
error_t acmeTestGenerateAccountKeys(void)
{
   error_t error;
   size_t n;
   EcDomainParameters params;
   EcPrivateKey privateKey;
   EcPublicKey publicKey;

   //Initialize EC key pair
   ecInitDomainParameters(&params);
   ecInitPrivateKey(&privateKey);
   ecInitPublicKey(&publicKey);

   //Start of exception handling block
   do
   {
      //Load EC domain parameters
      error = ecLoadDomainParameters(&params, SECP256R1_CURVE);
      //Any error to report?
      if(error)
         break;

      //Generate an EC key pair
      error = ecGenerateKeyPair(YARROW_PRNG_ALGO, &yarrowContext, &params,
         &privateKey, &publicKey);
      //Any error to report?
      if(error)
         break;

      //Export the EC private key to PEM format
      error = pemExportEcPrivateKey(SECP256R1_CURVE, &privateKey, &publicKey,
         accountPrivateKey, &n);
      //Any error to report?
      if(error)
         break;

      //Dump private key (for debugging purpose only)
      TRACE_INFO("Account private key (%" PRIuSIZE " bytes):\r\n", n);
      TRACE_INFO("%s\r\n", accountPrivateKey);

      //Export the EC public key to PEM format
      error = pemExportEcPublicKey(SECP256R1_CURVE, &publicKey, accountPublicKey, &n);
      //Any error to report?
      if(error)
         break;

      //Dump public key
      TRACE_INFO("Account public key (%" PRIuSIZE " bytes):\r\n", n);
      TRACE_INFO("%s\r\n", accountPublicKey);

      //End of exception handling block
   } while(0);

   //Release EC key pair
   ecFreeDomainParameters(&params);
   ecFreePrivateKey(&privateKey);
   ecFreePublicKey(&publicKey);

   //Return status code
   return error;
}


/**
 * @brief Certificate key pair generation
 * @return Error code
 **/

error_t acmeTestGenerateCertKeys(void)
{
   error_t error;
   size_t n;
   RsaPrivateKey privateKey;
   RsaPublicKey publicKey;

   //Initialize RSA key pair
   rsaInitPrivateKey(&privateKey);
   rsaInitPublicKey(&publicKey);

   //Start of exception handling block
   do
   {
      //Generate a RSA key pair
      error = rsaGenerateKeyPair(YARROW_PRNG_ALGO, &yarrowContext, 2048, 65537,
         &privateKey, &publicKey);
      //Any error to report?
      if(error)
         break;

      //Export the RSA private key to PEM format
      error = pemExportRsaPrivateKey(&privateKey, certPrivateKey, &n);
      //Any error to report?
      if(error)
         break;

      //Dump private key (for debugging purpose only)
      TRACE_INFO("Certificate private key (%" PRIuSIZE " bytes):\r\n", n);
      TRACE_INFO("%s\r\n", certPrivateKey);

      //Export the RSA public key to PEM format
      error = pemExportRsaPublicKey(&publicKey, certPublicKey, &n);
      //Any error to report?
      if(error)
         break;

      //Dump public key
      TRACE_INFO("Certificate public key (%" PRIuSIZE " bytes):\r\n", n);
      TRACE_INFO("%s\r\n", certPublicKey);

      //End of exception handling block
   } while(0);

   //Release RSA key pair
   rsaFreePrivateKey(&privateKey);
   rsaFreePublicKey(&publicKey);

   //Return status code
   return error;
}


/**
 * @brief Create a new ACME account
 * @return Error code
 **/

error_t acmeTestCreateAccount(void)
{
   error_t error;
   IpAddr serverIpAddr;
   AcmeAccountParams accountParams;

   //Start of exception handling block
   do
   {
      //Resolve ACME server host name
      error = getHostByName(NULL, APP_ACME_SERVER_NAME, &serverIpAddr, 0);
      //Any error to report?
      if(error)
         break;

      //Establish connection with the ACME server
      error = acmeClientConnect(&acmeClientContext, &serverIpAddr,
         APP_ACME_SERVER_PORT);
      //Any error to report?
      if(error)
         break;

      //Initialize account parameters
      memset(&accountParams, 0, sizeof(AcmeAccountParams));

      //Set ACME account parameters
      accountParams.numContacts = 1;
      accountParams.contacts[0] = APP_ACME_ACCOUNT_CONTACT;
      accountParams.termsOfServiceAgreed = TRUE;
      accountParams.publicKey = accountPublicKey;
      accountParams.publicKeyLen = strlen(accountPublicKey);
      accountParams.privateKey = accountPrivateKey;
      accountParams.privateKeyLen = strlen(accountPrivateKey);

      //Create a new ACME account
      error = acmeClientCreateAccount(&acmeClientContext, &accountParams);
      //Any error to report?
      if(error)
         break;

      //Gracefully disconnect from the ACME server
      error = acmeClientDisconnect(&acmeClientContext);
      //Any error to report?
      if(error)
         break;

      //End of exception handling block
   } while(0);

   //Close the connection with the ACME server
   acmeClientClose(&acmeClientContext);

   //Return status code
   return error;
}


/**
 * @brief Order a new certificate
 * @return Error code
 **/

error_t acmeTestOrderCert(void)
{
   error_t error;
   uint_t i;
   size_t n;
   IpAddr serverIpAddr;
   AcmeOrderParams orderParams;
   AcmeOrderStatus orderStatus;

   //Start of exception handling block
   do
   {
      //Resolve ACME server host name
      error = getHostByName(NULL, APP_ACME_SERVER_NAME, &serverIpAddr, 0);
      //Any error to report?
      if(error)
         break;

      //Establish connection with the ACME server
      error = acmeClientConnect(&acmeClientContext, &serverIpAddr,
         APP_ACME_SERVER_PORT);
      //Any error to report?
      if(error)
         break;

      //Initialize certificate order parameters
      memset(&orderParams, 0, sizeof(AcmeOrderParams));

      //Set certificate order parameters
      orderParams.numDomains = 1;
      orderParams.domains[0].name = APP_ACME_DOMAIN_NAME;
      orderParams.domains[0].challengeType = ACME_CHALLENGE_TYPE_TLS_ALPN_01;
      orderParams.publicKey = certPublicKey;
      orderParams.publicKeyLen = strlen(certPublicKey);
      orderParams.privateKey = certPrivateKey;
      orderParams.privateKeyLen = strlen(certPrivateKey);

      //Create a new certificate
      error = acmeClientCreateOrder(&acmeClientContext, &orderParams);
      //Any error to report?
      if(error)
         break;

      //Default order status
      orderStatus = ACME_ORDER_STATUS_NONE;

      //Poll the status of the order
      for(i = 0; i < 30; i++)
      {
         //Get the current status of the order
         error = acmeClientPollOrderStatus(&acmeClientContext, &orderStatus);
         //Any error to report?
         if(error)
            break;

