Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/demo/microchip/same54_xplained_pro/acme_client_demo/src/main.c
         //Once the certificate is issued, the order enters the "valid" state.
         //If an error occurs, the order moves to the "invalid" state
         if(orderStatus == ACME_ORDER_STATUS_VALID ||
            orderStatus == ACME_ORDER_STATUS_INVALID)
         {
            break;
         }

         //Polling delay
         osDelayTask(2000);
      }

      //Check the status of the order
      if(orderStatus != ACME_ORDER_STATUS_VALID)
      {
         error = ERROR_INVALID_STATUS;
         break;
      }

      //Download the certificate from the ACME server
      error = acmeClientDownloadCertificate(&acmeClientContext, certChain,
         sizeof(certChain) - 1, &n);
      //Any error to report?
      if(error)
         break;

      //Properly terminate the certificate chain with a NULL character
      certChain[n] = '\0';

      //Debug message
      TRACE_INFO("Certificate chain (%" PRIuSIZE " bytes):\r\n", n);
      TRACE_INFO("%s\r\n\r\n", certChain);

      //Gracefully disconnect from the ACME server
      error = acmeClientDisconnect(&acmeClientContext);
      //Any error to report?
      if(error)
         break;

      //End of exception handling block
   } while(0);

   //Close the connection with the ACME server
   acmeClientClose(&acmeClientContext);

   //Return status code
   return error;
}


/**
 * @brief ACME task
 * @param[in] param Unused parameter
 **/

void acmeTestTask(void *param)
{
   error_t error;
   uint_t i;

   //Debug message
   TRACE_INFO("Generating account key pair...\r\n");

   //Generate account key pair
   error = acmeTestGenerateAccountKeys();
   //Check status code
   if(error)
   {
      //Debug message
      TRACE_INFO("Failed to generate account key pair!\r\n");
   }

   //Debug message
   TRACE_INFO("Generating certificate key pair...\r\n");

   //Generate certificate key pair
   error = acmeTestGenerateCertKeys();
   //Check status code
   if(error)
   {
      //Debug message
      TRACE_INFO("Failed to generate certificate key pair!\r\n");
   }

   //Initialize ACME client context
   acmeClientInit(&acmeClientContext);

   //Register TLS initialization callback
   acmeClientRegisterTlsInitCallback(&acmeClientContext,
      acmeTestTlsInitCallback);

   //Set the PRNG algorithm to be used
   acmeClientSetPrng(&acmeClientContext, YARROW_PRNG_ALGO, &yarrowContext);

   //Set communication timeout
   acmeClientSetTimeout(&acmeClientContext, 30000);
   //Set the domain name of the ACME server
   acmeClientSetHost(&acmeClientContext, APP_ACME_SERVER_NAME);
   //Set the URI of the directory object
   acmeClientSetDirectoryUri(&acmeClientContext, APP_ACME_DIRECTORY_URI);

   //Account creation process
   do
   {
      //Create a new ACME account
      error = acmeTestCreateAccount();

      //Check status code
      if(error)
      {
         //Delay between unsuccessful attempts
         osDelayTask(10 * 1000);
      }

      //Check whether the ACME account has been successfully created
   } while(error);

   //Certificate order process
   while(1)
   {
      //Order a new certificate
      error = acmeTestOrderCert();

      //Check status code
      if(!error)
      {
         //The certificate is renewed every month
         for(i = 0; i < 30; i++)
         {
            osDelayTask(86400 * 1000);
         }
      }
      else
      {
         //Delay between unsuccessful attempts
         osDelayTask(86400 * 1000);
      }
   }
}


/**
 * @brief LED task
 * @param[in] param Unused parameter
 **/

void ledTask(void *param)
{
   //Endless loop
   while(1)
   {
      PORT_REGS->GROUP[LED0_GROUP].PORT_OUTCLR = LED0_MASK;
      osDelayTask(100);
      PORT_REGS->GROUP[LED0_GROUP].PORT_OUTSET = LED0_MASK;
      osDelayTask(900);
   }
}


/**
 * @brief Main entry point
 * @return Unused value
 **/

int_t main(void)
{
   error_t error;
   OsTaskId taskId;
   OsTaskParameters taskParams;
   NetInterface *interface;
   MacAddr macAddr;
#if (APP_USE_DHCP_CLIENT == DISABLED)
   Ipv4Addr ipv4Addr;
#endif
#if (APP_USE_SLAAC == DISABLED)
   Ipv6Addr ipv6Addr;
#endif

   //Update system core clock
   SystemCoreClockUpdate();

   //Initialize kernel
   osInitKernel();
   //Configure debug UART
   debugInit(115200);

   //Start-up message
   TRACE_INFO("\r\n");
   TRACE_INFO("************************************\r\n");
   TRACE_INFO("*** CycloneACME ACME Client Demo ***\r\n");
   TRACE_INFO("************************************\r\n");
   TRACE_INFO("Copyright: 2010-2024 Oryx Embedded SARL\r\n");
   TRACE_INFO("Compiled: %s %s\r\n", __DATE__, __TIME__);
   TRACE_INFO("Target: SAME54\r\n");
   TRACE_INFO("\r\n");

   //Configure I/Os
   ioInit();

   //Initialize hardware cryptographic accelerator
   error = same54CryptoInit();
   //Any error to report?
   if(error)
   {
      //Debug message
      TRACE_ERROR("Failed to initialize hardware crypto accelerator!\r\n");
   }

   //Generate a random seed
   error = trngGetRandomData(seed, sizeof(seed));
   //Any error to report?
   if(error)
   {
      //Debug message
      TRACE_ERROR("Failed to generate random data!\r\n");
   }

   //PRNG initialization
   error = yarrowInit(&yarrowContext);
   //Any error to report?
   if(error)
   {
      //Debug message
      TRACE_ERROR("Failed to initialize PRNG!\r\n");
   }

   //Properly seed the PRNG
   error = yarrowSeed(&yarrowContext, seed, sizeof(seed));
   //Any error to report?
   if(error)
   {
      //Debug message
      TRACE_ERROR("Failed to seed PRNG!\r\n");
   }

   //TCP/IP stack initialization
   error = netInit();
   //Any error to report?
   if(error)
   {
      //Debug message
      TRACE_ERROR("Failed to initialize TCP/IP stack!\r\n");
   }

   //Configure the first Ethernet interface
   interface = &netInterface[0];

   //Set interface name
   netSetInterfaceName(interface, APP_IF_NAME);
   //Set host name
   netSetHostname(interface, APP_HOST_NAME);
   //Set host MAC address
   macStringToAddr(APP_MAC_ADDR, &macAddr);
   netSetMacAddr(interface, &macAddr);
   //Select the relevant network adapter
   netSetDriver(interface, &same54EthDriver);
   netSetPhyDriver(interface, &ksz8091PhyDriver);

   //Initialize network interface
   error = netConfigInterface(interface);
   //Any error to report?
   if(error)
   {
      //Debug message
      TRACE_ERROR("Failed to configure interface %s!\r\n", interface->name);
   }

#if (IPV4_SUPPORT == ENABLED)
#if (APP_USE_DHCP_CLIENT == ENABLED)
   //Get default settings
   dhcpClientGetDefaultSettings(&dhcpClientSettings);
   //Set the network interface to be configured by DHCP
   dhcpClientSettings.interface = interface;
   //Disable rapid commit option
   dhcpClientSettings.rapidCommit = FALSE;

   //DHCP client initialization
   error = dhcpClientInit(&dhcpClientContext, &dhcpClientSettings);
   //Failed to initialize DHCP client?
   if(error)
   {
      //Debug message
      TRACE_ERROR("Failed to initialize DHCP client!\r\n");
   }

